{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "./models/google/gemma-4-E4B-it",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.1",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "embedding_projection",
    "language_model.layers.15.mlp.gate_proj",
    "37.mlp.gate_proj",
    "36.mlp.gate_proj",
    "39.self_attn.q_proj",
    "33.mlp.up_proj",
    "19.self_attn.q_proj",
    "39.mlp.down_proj",
    "language_model.layers.3.self_attn.k_proj",
    "38.mlp.up_proj",
    "33.mlp.gate_proj",
    "40.mlp.down_proj",
    "linear",
    "language_model.layers.15.self_attn.k_proj",
    "34.self_attn.o_proj",
    "22.self_attn.o_proj",
    "35.mlp.gate_proj",
    "language_model.layers.14.self_attn.k_proj",
    "26.mlp.gate_proj",
    "18.mlp.down_proj",
    "20.self_attn.v_proj",
    "19.mlp.down_proj",
    "39.mlp.gate_proj",
    "language_model.layers.14.mlp.down_proj",
    "27.mlp.gate_proj",
    "27.mlp.down_proj",
    "language_model.layers.8.mlp.gate_proj",
    "language_model.layers.0.mlp.down_proj",
    "language_model.layers.10.self_attn.k_proj",
    "language_model.layers.7.self_attn.o_proj",
    "language_model.layers.11.mlp.up_proj",
    "22.mlp.up_proj",
    "27.self_attn.o_proj",
    "language_model.layers.0.self_attn.v_proj",
    "language_model.layers.14.self_attn.o_proj",
    "language_model.layers.2.self_attn.q_proj",
    "30.mlp.down_proj",
    "language_model.layers.4.mlp.up_proj",
    "language_model.layers.4.mlp.down_proj",
    "language_model.layers.1.self_attn.v_proj",
    "21.mlp.down_proj",
    "language_model.layers.12.mlp.up_proj",
    "language_model.layers.2.self_attn.o_proj",
    "29.self_attn.q_proj",
    "language_model.layers.0.self_attn.o_proj",
    "38.self_attn.q_proj",
    "36.self_attn.o_proj",
    "per_layer_projection",
    "17.self_attn.q_proj",
    "36.mlp.up_proj",
    "language_model.layers.13.self_attn.o_proj",
    "28.mlp.gate_proj",
    "17.mlp.gate_proj",
    "40.self_attn.o_proj",
    "language_model.layers.1.mlp.up_proj",
    "language_model.layers.10.self_attn.q_proj",
    "language_model.layers.10.mlp.up_proj",
    "language_model.layers.11.self_attn.k_proj",
    "input_proj_linear",
    "37.self_attn.q_proj",
    "output_proj",
    "29.mlp.down_proj",
    "language_model.layers.9.self_attn.o_proj",
    "language_model.layers.10.self_attn.o_proj",
    "language_model.layers.2.mlp.gate_proj",
    "21.mlp.gate_proj",
    "16.self_attn.v_proj",
    "language_model.layers.13.mlp.up_proj",
    "20.mlp.gate_proj",
    "18.self_attn.k_proj",
    "20.self_attn.o_proj",
    "language_model.layers.9.self_attn.k_proj",
    "language_model.layers.11.self_attn.v_proj",
    "language_model.layers.6.mlp.up_proj",
    "16.mlp.down_proj",
    "38.mlp.down_proj",
    "language_model.layers.1.mlp.gate_proj",
    "27.mlp.up_proj",
    "19.mlp.gate_proj",
    "language_model.layers.7.mlp.down_proj",
    "language_model.layers.8.self_attn.q_proj",
    "36.mlp.down_proj",
    "41.mlp.down_proj",
    "language_model.layers.2.mlp.down_proj",
    "language_model.layers.12.mlp.gate_proj",
    "31.mlp.down_proj",
    "38.mlp.gate_proj",
    "language_model.layers.0.self_attn.q_proj",
    "32.self_attn.o_proj",
    "language_model.layers.8.mlp.down_proj",
    "19.self_attn.o_proj",
    "language_model.layers.9.self_attn.v_proj",
    "16.mlp.up_proj",
    "16.self_attn.k_proj",
    "37.self_attn.o_proj",
    "35.self_attn.q_proj",
    "33.self_attn.o_proj",
    "language_model.layers.9.mlp.gate_proj",
    "30.self_attn.q_proj",
    "16.self_attn.o_proj",
    "language_model.layers.12.self_attn.q_proj",
    "language_model.layers.4.self_attn.k_proj",
    "22.mlp.down_proj",
    "29.mlp.gate_proj",
    "40.self_attn.q_proj",
    "language_model.layers.14.mlp.up_proj",
    "language_model.layers.5.self_attn.k_proj",
    "language_model.layers.13.mlp.down_proj",
    "25.self_attn.o_proj",
    "language_model.layers.10.mlp.down_proj",
    "language_model.layers.3.mlp.gate_proj",
    "language_model.layers.15.self_attn.o_proj",
    "21.self_attn.o_proj",
    "language_model.layers.13.mlp.gate_proj",
    "language_model.layers.5.self_attn.q_proj",
    "language_model.layers.4.mlp.gate_proj",
    "41.self_attn.q_proj",
    "26.self_attn.o_proj",
    "language_model.layers.6.self_attn.o_proj",
    "language_model.layers.13.self_attn.k_proj",
    "41.self_attn.o_proj",
    "37.mlp.up_proj",
    "language_model.layers.13.self_attn.v_proj",
    "language_model.layers.9.mlp.up_proj",
    "language_model.layers.8.self_attn.o_proj",
    "language_model.layers.8.mlp.up_proj",
    "30.mlp.gate_proj",
    "language_model.layers.1.self_attn.q_proj",
    "30.mlp.up_proj",
    "17.self_attn.v_proj",
    "language_model.layers.7.mlp.gate_proj",
    "language_model.layers.3.self_attn.v_proj",
    "17.mlp.down_proj",
    "per_layer_input_gate",
    "34.mlp.up_proj",
    "language_model.layers.3.mlp.down_proj",
    "17.self_attn.k_proj",
    "21.mlp.up_proj",
    "language_model.layers.3.self_attn.q_proj",
    "language_model.layers.4.self_attn.q_proj",
    "language_model.layers.10.self_attn.v_proj",
    "34.mlp.down_proj",
    "relative_k_proj",
    "language_model.layers.2.mlp.up_proj",
    "25.mlp.up_proj",
    "language_model.layers.0.mlp.up_proj",
    "18.self_attn.v_proj",
    "16.self_attn.q_proj",
    "31.mlp.up_proj",
    "language_model.layers.8.self_attn.v_proj",
    "language_model.layers.0.mlp.gate_proj",
    "language_model.layers.4.self_attn.o_proj",
    "25.self_attn.q_proj",
    "language_model.layers.7.mlp.up_proj",
    "18.mlp.gate_proj",
    "language_model.layers.5.mlp.down_proj",
    "24.self_attn.o_proj",
    "37.mlp.down_proj",
    "21.self_attn.v_proj",
    "language_model.layers.11.mlp.down_proj",
    "20.mlp.up_proj",
    "language_model.layers.6.mlp.down_proj",
    "language_model.layers.11.self_attn.q_proj",
    "39.self_attn.o_proj",
    "31.mlp.gate_proj",
    "language_model.layers.15.mlp.up_proj",
    "19.self_attn.k_proj",
    "language_model.layers.7.self_attn.q_proj",
    "language_model.layers.11.self_attn.o_proj",
    "20.self_attn.q_proj",
    "input_proj",
    "22.mlp.gate_proj",
    "22.self_attn.v_proj",
    "36.self_attn.q_proj",
    "34.mlp.gate_proj",
    "28.self_attn.q_proj",
    "language_model.layers.14.self_attn.v_proj",
    "33.mlp.down_proj",
    "language_model.layers.6.self_attn.k_proj",
    "30.self_attn.o_proj",
    "17.self_attn.o_proj",
    "language_model.layers.6.self_attn.q_proj",
    "18.mlp.up_proj",
    "24.mlp.down_proj",
    "language_model.layers.2.self_attn.k_proj",
    "language_model.layers.8.self_attn.k_proj",
    "33.self_attn.q_proj",
    "19.mlp.up_proj",
    "language_model.layers.12.self_attn.o_proj",
    "language_model.layers.3.mlp.up_proj",
    "25.mlp.down_proj",
    "language_model.layers.14.mlp.gate_proj",
    "22.self_attn.k_proj",
    "35.self_attn.o_proj",
    "24.mlp.up_proj",
    "language_model.layers.6.self_attn.v_proj",
    "21.self_attn.k_proj",
    "31.self_attn.q_proj",
    "20.mlp.down_proj",
    "18.self_attn.o_proj",
    "language_model.layers.7.self_attn.v_proj",
    "34.self_attn.q_proj",
    "39.mlp.up_proj",
    "28.mlp.down_proj",
    "35.mlp.down_proj",
    "16.mlp.gate_proj",
    "language_model.layers.1.self_attn.o_proj",
    "language_model.layers.6.mlp.gate_proj",
    "31.self_attn.o_proj",
    "23.self_attn.o_proj",
    "29.self_attn.o_proj",
    "language_model.layers.12.self_attn.k_proj",
    "32.mlp.down_proj",
    "language_model.layers.5.self_attn.o_proj",
    "language_model.layers.0.self_attn.k_proj",
    "26.mlp.down_proj",
    "language_model.layers.14.self_attn.q_proj",
    "21.self_attn.q_proj",
    "language_model.layers.15.self_attn.q_proj",
    "19.self_attn.v_proj",
    "23.mlp.gate_proj",
    "language_model.layers.9.self_attn.q_proj",
    "27.self_attn.q_proj",
    "language_model.layers.4.self_attn.v_proj",
    "29.mlp.up_proj",
    "20.self_attn.k_proj",
    "language_model.layers.3.self_attn.o_proj",
    "22.self_attn.q_proj",
    "40.mlp.up_proj",
    "23.mlp.up_proj",
    "language_model.layers.15.mlp.down_proj",
    "language_model.layers.1.mlp.down_proj",
    "language_model.layers.11.mlp.gate_proj",
    "26.mlp.up_proj",
    "language_model.layers.15.self_attn.v_proj",
    "language_model.layers.10.mlp.gate_proj",
    "language_model.layers.1.self_attn.k_proj",
    "28.self_attn.o_proj",
    "38.self_attn.o_proj",
    "language_model.layers.5.mlp.up_proj",
    "24.self_attn.q_proj",
    "17.mlp.up_proj",
    "35.mlp.up_proj",
    "23.self_attn.v_proj",
    "language_model.layers.2.self_attn.v_proj",
    "language_model.layers.12.self_attn.v_proj",
    "32.mlp.up_proj",
    "24.mlp.gate_proj",
    "language_model.layers.12.mlp.down_proj",
    "41.mlp.gate_proj",
    "per_layer_model_projection",
    "25.mlp.gate_proj",
    "language_model.layers.5.self_attn.v_proj",
    "40.mlp.gate_proj",
    "language_model.layers.13.self_attn.q_proj",
    "41.mlp.up_proj",
    "language_model.layers.7.self_attn.k_proj",
    "language_model.layers.5.mlp.gate_proj",
    "language_model.layers.9.mlp.down_proj",
    "18.self_attn.q_proj",
    "32.mlp.gate_proj",
    "28.mlp.up_proj",
    "23.self_attn.q_proj",
    "23.mlp.down_proj",
    "23.self_attn.k_proj",
    "32.self_attn.q_proj",
    "26.self_attn.q_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}